{
  "config": {
    "step": {
      "user": {
        "title": "Configuración de Agua de San Francisco",
        "description": "Conéctate a tu cuenta SFPUC para monitorear el uso de agua.\n\nRequerido: Nombre de usuario y contraseña de SFPUC desde https://myaccount-water.sfpuc.org\n\n Sensor de Agua\n• Uso diario en galones (acumulativo)\n• Se actualiza cada 12 horas\n\nConsejos de Configuración:\n• El nombre de usuario es típicamente tu número de cuenta o email\n• La contraseña es tu contraseña del portal SFPUC\n• Los datos se actualizan automáticamente cada 12 horas\n• Todos los datos se almacenan localmente en la base de datos de Home Assistant",
        "data": {
          "username": "Nombre de Usuario SFPUC",
          "password": "Contraseña SFPUC"
        },
        "data_description": {
          "username": "Tu nombre de usuario de cuenta SFPUC o número de cuenta utilizado para iniciar sesión en el portal de agua.",
          "password": "Tu contraseña de cuenta SFPUC para acceder a los datos de uso."
        }
      }
    },
    "error": {
      "invalid_auth": "❌ Nombre de usuario o contraseña inválidos. Por favor verifica tus credenciales SFPUC e intenta nuevamente.",
      "unknown": "❌ Ocurrió un error inesperado durante la configuración. Por favor verifica tu conexión a internet e intenta nuevamente."
    }
  },
  "options": {
    "step": {
      "init": {
        "title": "Configuración de Agua SF",
        "description": "La integración de Agua SF usa configuraciones automáticas optimizadas para datos diarios de uso de agua. Las actualizaciones ocurren cada 12 horas para mantenerse al día con los datos SFPUC mientras se respetan los recursos del servidor.\n\n**Configuración Actual:**\n• Intervalo de actualización: Fijo en 12 horas\n• Fuente de datos: Uso diario SFPUC\n• Almacenamiento: Base de datos local de Home Assistant\n\nNo se necesitan cambios de configuración."
      }
    }
  },
  "entity": {
    "sensor": {
      "current_bill_water_usage_to_date": {
        "name": "Uso de agua del período de facturación actual hasta la fecha"
      }
    }
  },
  "issues": {
    "invalid_credentials": {
      "title": "Credenciales SFPUC Inválidas",
      "description": "Las credenciales para la cuenta \"{account}\" ya no son válidas. Esto podría deberse a:\n\n• La contraseña ha sido cambiada\n• La cuenta SFPUC está bloqueada\n• Los permisos de la cuenta han cambiado\n\nHaz clic a continuación para actualizar tus credenciales."
    }
  }
}
